[
  {
    "name"        : "Aatrox",
    "imageChp"    : "aatrox/chp.pnj",
    "type"        : "Combattant",
    "defense"     : 40,
    "attack"      : 80,
    "power"       : 30,
    "difficulty"  : 40,
    "NameP"       : "Puits de Sang",
    "passive"     : "PASSIVE :  Les coûts en PV des compétences d'Aatrox chargent Puits de Sang, jusqu'à un maximum de 105 - 870 PV.\n La charge de Puits de Sang diminue de 2% chaque seconde si Aatrox n'est pas en combat depuis au moins 5 secondes. Aatrox augmente sa vitesse d'attaque de 0.3 - 0.55% pour chaque 1% de charge de Puits de Sang, jusqu'à un maximum de 30 - 55% de vitesse d'attaque.\n S'il subit des dégâts mortels, Aatrox se purge de tous les effets de contrôle de foule, entre en stase et récupère des PV équivalents à 36.75 - 304.5 (+100% de la charge de Puits de Sang) en 3 secondes, jusqu'à un maximum de 141.75 - 1174.5 PV.",
    "imgPassive"  : "aatrox/P.pnj",
    "NameA"       : "Vol Obscur",
    "A"           : "ACTIVE :  Aatrox fonce vers la zone ciblée, infligeant des dégâts physiques aux unités ennemies dans la zone et envoyant dans les airs les unités ennemies dans le centre de la zone pendant 1 seconde.",
    "imgA"        : "aatrox/A.pnj",
    "NameZ"       : "Choc Vital",
    "Z"           : "ACTIVÉE :  Toutes les 3 attaques de base, Aatrox perd des PV et inflige des dégâts physiques supplémentaires à l'impact.\n DÉSACTIVÉE :  Toutes les 3 attaques de base, Aatrox récupère des PV. Si Aatrox possède moins de 50% de ses PV, le soin de Choc Vital est augmenté de 200%.",
    "imgZ"        : "aatrox/Z.pnj",
    "NameE"       : "Lame du Tourment",
    "E"           : "ACTIVE :  Aatrox lance une vague d'énergie dans la direction ciblée, infligeant des dégâts magiques aux unités ennemies traversés et les ralentissant de 40%.",
    "imgE"        : "aatrox/E.pnj",
    "NameR"       : "Massacre",
    "R"           : "ACTIVE :  Aatrox aspire le sang de ses ennemis autour de lui, infligeant des dégâts magiques aux champions ennemis proches.\n Massacre augmente la charge de Puits de Sang de 20% pour chaque champion ennemi touché. Après Massacre, Aatrox augmente sa vitesse d'attaque et sa portée d'attaque pendant 12 secondes.",
    "imgR"        : "aatrox/R.pnj",
    "history"     : "text/aatrox.txt"
  },

  {
    "name"        : "Ahri",
    "imageChp"    : "ahri/chp.pnj",
    "type"        : "Mage",
    "defense"     : 40,
    "attack"      : 30,
    "power"       : 80,
    "difficulty"  : 50,
    "NameP"       : "Vol Essentiel",
    "passive"     : "PASSIVE :  Les compétences d'Ahri octroient 1 effet Vol Essentiel par unité ennemie touchée, jusqu'à un maximum de 3 effets par compétence. À 9 effets Vol Essentiel, la prochaine compétence d'Ahri les consomme et la soigne à chaque fois qu'elle touche une unité ennemie.",
    "imgPassive"  : "ahri/P.pnj",
    "NameA"       : "Orbe d'Illusion",
    "A"           : "ACTIVE :  Ahri lance son orbe vers la direction ciblée, infligeant des dégâts magiques aux unités ennemies traversées.\n L'orbe revient ensuite vers Ahri, infligeant des dégâts bruts supplémentaires aux unités ennemies traversées.\n Au début d'Orbe d'Illusion, Ahri augmente sa vitesse de déplacement de 215, qui diminue à 80 en 0.5 sec.",
    "imgA"        : "ahri/A.pnj",
    "NameZ"       : "Lucioles",
    "Z"           : "ACTIVE :  Ahri génère 3 lucioles qui tournent autour d'elle. Les lucioles se dirigent vers les unités ennemies les plus proches (en priorité les champions ennemis), infligeant des dégâts magiques.\n Chaque luciole supplémentaire sur une même unité ennemie infligera des dégâts magiques réduits de 70%. Lucioles dure jusqu'à 5 sec.",
    "imgZ"        : "ahri/Z.pnj",
    "NameE"       : "Charme",
    "E"           : "ACTIVE :  Ahri lance un baiser vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée et la charmant pendant 1 / 1.25 / 1.5 / 1.75 / 2 sec.",
    "imgE"        : "ahri/E.pnj",
    "NameR"       : "Assaut Spirituel",
    "R"           : "ACTIVE :  Ahri effectue un dash vers la direction ciblée et génère 3 traits d'énergie autour d'elle.\n Les traits d'énergie se dirigent vers les unités ennemies les plus proches (en priorité les champions ennemis), infligeant des dégâts magiques. Assaut Spirituel peut être incanté jusqu'à 2 fois supplémentaires sans coût en mana pendant 10 sec maximum après la première incantation.\n Une même unité ennemie ne peut être touché que par 1 trait d'énergie par incantation d'Assaut Spirituel.",
    "imgR"        : "ahri/R.pnj",
    "history"     : "text/ahri.txt"
  },

  {
    "name"        : "Akali",
    "imageChp"    : "akali/chp.pnj",
    "type"        : "Assasin",
    "defense"     : 30,
    "attack"      : 50,
    "power"       : 80,
    "difficulty"  : 70,
    "NameP"       : "Maîtrises Jumelles",
    "passive"     : "Les deux prochaines attaques de base d'Akali infligent des effets supplémentaires à l'impact.\n MAÎTRISE DE LA PUISSANCE : La première attaque de base d'Akali lui rend des PV équivalents à 5 - 60 (+ 60%) (+ 45%) à l'impact.\n MAÎTRISE DE LA FORCE : La deuxième attaque de base d'Akali dans les 4 secondes inflige des dégâts magiques supplémentaires équivalents à 10 - 100 (+ 50%) (+ 65%) à l'impact.",
    "imgPassive"  : "akali/P.pnj",
    "NameA"       : "Marque d'Assasin",
    "A"           : "ACTIVE : Akali lance son kama sur l'unité ennemie ciblée, infligeant des dégâts magiques et générant une marque pendant 6 secondes.\n Les attaques de base d'Akali activent la marque, infligeant des dégâts magiques supplémentaires et récupérant 40 énergie.",
    "imgA"        : "akali/A.pnj",
    "NameZ"       : "Linceul Nébuleux",
    "Z"           : "ACTIVE :  Après 0.25 seconde d'incantation, Akali se téléporte vers la zone ciblée et génère un voile de fumée.\n Le voile de fumée octroie la vision de la zone et ralentit les unités ennemies.\n Si elle est dans le voile de fumée, Akali se rend invisible et augmente sa vitesse de déplacement.\n Si elle lance une attaque de base ou une compétence dans le voile de fumée, Akali est révélée pendant 0.65 secondes.",
    "imgZ"        : "akali/Z.pnj",
    "NameE"       : "Taille Incurvée",
    "E"           : "Akali fait tourner ses kamas autour d'elle, infligeant des dégâts physiques aux unités ennemies proches.\n Si Taille Incurvée} tue une unité ennemie, son délai de récupération est réduit de 60%.",
    "imgE"        : "akali/E.pnj",
    "NameR"       : "Danse des Ombres",
    "R"           : "PASSIVE : Akali génère 1 Essence des Ombres toutes les 30 / 22.5 / 15 secondes, jusqu'à un maximum de 3 Essences des Ombres.\n Tuer un champion ennemi ou assister un champion allié génère 1 Essence des Ombres.\n ACTIVE : Akali fonce sur l'unité ennemie ciblée et la traverse, consommant 1 Essence des Ombres et infligeant des dégâts magiques.\n Si Danse des Ombres cible une unité ennemie marquée, la distance de traversée d'Akali est réduite de 50%.",
    "imgR"        : "akali/R.pnj",
    "history"     : "text/akali.txt"
  },

  {
    "name"        : "Alistar",
    "imageChp"    : "alistar/chp.pnj",
    "type"        : "Tank",
    "defense"     : 90,
    "attack"      : 50,
    "power"       : 60,
    "difficulty"  : 70,
    "NameP"       : "Cri Triomphant",
    "passive"     : "PASSIVE :  Alistar génère 1 effet Triomphe à chaque fois qu'il inflige inflige un étourdissement ou une projection contre un champion ennemi, et à chaque fois qu'un sbire ennemi ou un petit monstre meurt.\n À 7 effets Triomphe, Alistar crie, consommant les effets Triomphe, se soignant et soignant le champion allié le plus proche. SOIN : 20 - 139. SOIN ALLIÉ : 40 - 278. Si un champion ennemi ou un monstre épique meurt, Alistar génère le maximum d'effets Triomphe.",
    "imgPassive"  : "alistar/P.pnj",
    "NameA"       : "Atomisation",
    "A"           : "ACTIVE : Alistar frappe le sol dans une zone autour de lui, infligeant des dégâts magiques aux unités ennemies touchées et les projetant pendant 1 sec.",
    "imgA"        : "alistar/A.pnj",
    "NameZ"       : "Cout de Tête",
    "Z"           : "ACTIVE : Alistar effectue un dash vers l'unité ennemie ciblée, infligeant des dégâts magiques, le repoussant et l'étourdissant pendant 1 sec.",
    "imgZ"        : "alistar/Z.pnj",
    "NameE"       : "Piétinement",
    "E"           : "ACTIVE : Alistar piétine le sol dans une zone autour de lui, infligeant des dégâts magiques aux unités ennemies touchées.\n Pendant Piétinement, Alistar peut traverser les unités et génère 1 effet Piétinement à chaque fois qu'un champion ennemi est touché.\n À 5 effets Piétinement, la prochaine attaque de base d'Alistar les consommera pour infliger des dégâts magiques supplémentaires à l'impact et étourdir la cible pendant 1 sec. Piétinement dure jusqu'à 5 sec.",
    "imgE"        : "alistar/E.pnj",
    "NameR"       : "Volonté de Fer",
    "R"           : "ACTIVE : Alistar se purge de tous les effets de contrôle de foule et subit des dégâts physiques et des dégâts magiques réduits de 50 / 60 / 70% pendant 7 sec.",
    "imgR"        : "alistar/R.pnj",
    "history"     : "text/alistar.txt"
  },

  {
    "name"        : "Amumu",
    "imageChp"    : "amumu/chp.pnj",
    "type"        : "Tank",
    "defense"     : 60,
    "attack"      : 20,
    "power"       : 80,
    "difficulty"  : 30,
    "NameP"       : "Doigt de la Malédiction",
    "passive"     : "PASSIVE :  Les attaques de base d'Amumu réduisent la résistance magique de la cible de 15 / 25 / 35 pendant 3 secondes.",
    "imgPassive"  : "amumu/P.pnj",
    "NameA"       : "Jet de Bandelettes",
    "A"           : "ACTIVE :  Amumu lance une bandelette dans la direction ciblée, infligeant des dégâts magiques à la premiėre unité ennemie touchée, l'étourdissant pendant 1 seconde et attirant Amumu vers elle.",
    "imgA"        : "amumu/A.pnj",
    "NameZ"       : "Désespoir",
    "Z"           : "ACTIVABLE/DÉSACTIVABLE : Amumu pleure, infligeant des dégâts magiques aux unités ennemies dans la zone chaque seconde.",
    "imgZ"        : "amumu/Z.pnj",
    "NameE"       : "Colère",
    "E"           : "PASSIVE : Amumu subit des dégâts physiques réduits de 2 / 4 / 6 / 8 / 10.\n ACTIVE : Amumu libère sa colère, infligeant des dégâts magiques aux les unités ennemies dans la zone.\n Le délai de récupération de Colère est réduit de 0.5 seconde á chaque fois qu'Amumu est touché par une attaque de base.",
    "imgE"        : "amumu/E.pnj",
    "NameR"       : "Malédiction d'Amumu",
    "R"           : "ACTIVE : Amumu emmêle ses ennemis, infligeant des dégâts magiques aux unités ennemies dans la zone, les immobilisant et les désarmant pendant 2 secondes.",
    "imgR"        : "amumu/R.pnj",
    "history"     : "text/amumu.txt"
  },

  {
    "name"        : "Anivia",
    "imageChp"    : "anivia/chp.pnj",
    "type"        : "Mage",
    "defense"     : 40,
    "attack"      : 10,
    "power"       : 100,
    "difficulty"  : 100,
    "NameP"       : "Renaissance",
    "passive"     : "PASSIVE : Quand elle subit des dégâts mortels, Anivia se transforme en oeuf avec 100% de ses PV maximum, devient incapable d'agir et augmente son armure et sa résistance magique de -40 / -25 / -10 / 5 / 20. À la fin de Renaissance, Anivia est ressuscité.",
    "imgPassive"  : "anivia/P.pnj",
    "NameA"       : "Lance de Glace",
    "A"           : "PREMIÈRE ACTIVATION : Anivia lance un bloc de glace dans la direction ciblée, infligeant des dégâts magiques aux unités ennemies traversées et les ralentissant de 20% pendant 3 secondes.\n À sa portée maximum, Lance de Glace explose automatiquement.\n DEUXIÈME ACTIVATION : Anivia fait exploser le bloc de glace, infligeant des dégâts magiques aux unités ennemies dans la zone, les étourdissant pendant 1.1 / 1.2 / 1.3 / 1.4 / 1.5 secondes et les ralentissant de 20% pendant 3 secondes.",
    "imgA"        : "anivia/A.pnj",
    "NameZ"       : "Cristallisation",
    "Z"           : "ACTIVE : Anivia invoque un mur de glace infranchissable d'une largeur de 400 / 500 / 600 / 700 / 800 unités de distance dans la zone ciblée, repoussant les unités ennemies dans la zone.\n Cristallisation dure 5 secondes et octroie la vision de la zone pendant 5 secondes.",
    "imgZ"        : "anivia/Z.pnj",
    "NameE"       : "Gelure",
    "E"           : "ACTIVE : Anivia lance un trait de glace sur l'unité ennemie ciblée, infligeant des dégâts magiques.\n Si la cible est étourdie par Lance de Glace ou touchée par Tempête Glaciale à sa taille maximum, Gelure lui infligera des dégâts magiques supplémentaires.",
    "imgE"        : "anivia/E.pnj",
    "NameR"       : "Tempête Glaciale",
    "R"           : "PASSIVE : Anivia invoque une tempête de glace dans la zone ciblée, infligeant des dégâts magiques chaque seconde aux unités ennemies dans la zone et les ralentit de 20 / 30 / 40% pendant 1 seconde.\n La taille de Tempête Glaciale augmente en 1.5 seconde. À sa taille maximum, Tempête Glaciale inflige des dégâts magiques augmentés de 200% chaque seconde aux unités ennemies dans la zone et les ralentit de 30 / 45 / 60% pendant 1 seconde.\n Après 1 seconde, Anivia peut désactiver Tempête Glaciale. Si Anivia est affecté par une interruption (sauf une provocation, une terreur ou un charme), Tempête Glaciale est désactivé.\n Tempête Glaciale coûte 40 / 50 / 60 Mana par seconde.",
    "imgR"        : "anivia/R.pnj",
    "history"     : "text/anivia.txt"
  },

  {
    "name"        : "Annie",
    "imageChp"    : "annie/chp.pnj",
    "type"        : "Mage",
    "defense"     : 30,
    "attack"      : 20,
    "power"       : 100,
    "difficulty"  : 60,
    "NameP"       : "Pyromanie",
    "passive"     : "PASSIVE :  Après avoir lancé 4 compétences, la prochaine compétence infligeant des dégâts d'Annie étourdira les unités ennemies touchées pendant 1.25 / 1.5 / 1.75 secondes.",
    "imgPassive"  : "annie/P.pnj",
    "NameA"       : "Désintégration",
    "A"           : "ACTIVE : Annie lance une boule de feu sur l'unité ennemie ciblée, infligeant des dégâts magiques.\n Si Désintégration tue la cible, son délai de récupération est réduit de 50% et Annie récupère 60 / 65 / 70 / 75 / 80 Mana.",
    "imgA"        : "annie/A.pnj",
    "NameZ"       : "Incinération",
    "Z"           : "ACTIVE : Annie lance un cône de flammes dans la direction ciblée, infligeant des dégâts magiques aux unités ennemies dans la zone.",
    "imgZ"        : "annie/Z.pnj",
    "NameE"       : "Bouclier en Fusion",
    "E"           : "ACTIVE : Annie génère un bouclier de flammes sur elle et Tibbers, subissant des dégâts physiques et des dégâts magiques réduits de 16 / 22 / 28 / 34 / 40% pendant 3 secondes.\n Pendant Bouclier en Fusion, Annie et Tibbers inflige des dégâts magiques à chaque fois que les unités ennemies leur lancent des attaques de base.",
    "imgE"        : "annie/E.pnj",
    "NameR"       : "Invocation : Tibbers",
    "R"           : "ACTIVE :  Annie invoque Tibbers dans la zone ciblée, infligeant des dégâts magiques aux unités ennemies dans la zone.\n À la fin d'Invocation : Annie peut contrôler Tibbers pendant 45 secondes.\n Tibbers inflige des dégâts magiques chaque seconde aux unités ennemies dans la zone.\n Si Annie inflige Pyromanie à au moins une cible ou lance Invocation : Tibbers enrage, augmentant sa vitesse d'attaque de 275% et sa vitesse de déplacement de 100%, diminuant en 3 secondes. Si Annie est tué, Tibbers enrage et récupère des PV équivalents à 50% de ses PV manquants.\n Si Tibbers n'est pas en combat depuis au moins 5 secondes, il récupère des PV équivalents à 6% de ses PV maximum chaque seconde et augmente sa vitesse de déplacement quand il se déplace vers Annie.",
    "imgR"        : "annie/R.pnj",
    "history"     : "text/annie.txt"
  },

  {
    "name"        : "Ashe",
    "imageChp"    : "ashe/chp.pnj",
    "type"        : "Tireur",
    "defense"     : 30,
    "attack"      : 70,
    "power"       : 20,
    "difficulty"  : 40,
    "NameP"       : "Tir Givrant",
    "passive"     : "PASSIVE :  Les attaques de base et les compétences d'Ashe ralentissent la cible de 10 / 12 / 14 / 16 / 18 / 20% pendant 2 secondes.\n Si la cible est affectée par Tir Givrant, les attaques de base d'Ashe lui inflige des dégâts physiques supplémentaires équivalents à 10% (+100%) (+100%) des dégâts d'attaque.\n Les coups critiques d'Ashe n'infligent pas de dégâts supplémentaires, mais augmentent le ralentissement de Tir Givrant à 30 / 36 / 42 / 48 / 54 / 60%.",
    "imgPassive"  : "ashe/P.pnj",
    "NameA"       : "Concentration du Ranger",
    "A"           : "PASSIVE :  Quand Concentration du Ranger n'est pas lancé, les attaques de base d'Ashe génèrent 1 effet Concentration pendant 4 secondes, jusqu'à un maximum de 4 effets.\n Si Ashe n'est pas en combat depuis au moins 4 secondes, les effets Concentration diminuent de 1 toutes les secondes.\n ACTIVE :  Ashe consomme les 4 effets Concentration et augmente sa vitesse d'attaque de 20 / 25 / 30 / 35 / 40% pendant 4 secondes.\n Pendant la durée Concentration du Ranger, Ashe ne peut pas générer d'effets Concentration du Ranger et ses attaques de base deviennent des salves de 5 flèches, infligeant des dégâts physiques équivalents à 21 / 22 / 23 / 24 / 25% des dégâts d'attaque par flèche à la cible.",
    "imgA"        : "ashe/A.pnj",
    "NameZ"       : "Salve",
    "Z"           : "ACTIVE : Ashe lance un cône de 9 flèches dans la direction ciblée, infligeant des dégâts physiques aux unités ennemies touchées dans la zone.\n Les unités ennemies peuvent être touchées par plusieurs flèches, mais ne subiront les dégâts que d'une flèche. Si la cible est un champion ennemi, Salve lui infligera le ralentissement critique de Tir Givrant.\n Salve peut infliger un coup critique.",
    "imgZ"        : "ashe/Z.pnj",
    "NameE"       : "Rapace",
    "E"           : "PASSIVE : Ashe génère 1 charge de Rapace toutes les 90 / 80 / 70 / 60 / 50 secondes, jusqu'à un maximum de 2 charges.\n ACTIVE :  Ashe consomme 1 charge de Rapace et lance un faucon de glace dans la zone ciblée, octroyant la vision de la zone traversée pendant 2 secondes.\n À sa portée maximum, Rapace octroie la vision de la zone pendant 5 secondes.",
    "imgE"        : "ashe/E.pnj",
    "NameR"       : "Flèche de Cristal Enchantée",
    "R"           : "ACTIVE : Ashe lance une flèche de glace dans la direction ciblée, infligeant des dégâts magiques au premier champion ennemi touché et l'étourdissant pendant 1 - 3.5 secondes.\n Si la flèche de glace touche un champion ennemi, Flèche de Cristal Enchantée inflige des dégâts magiques réduits de 50% aux unités ennemies dans la zone.",
    "imgR"        : "ashe/R.pnj",
    "history"     : "text/ashe.txt"
  },

  {
    "name"        : "Aurélion Sol",
    "imageChp"    : "aurelionSol/chp.pnj",
    "type"        : "Mage",
    "defense"     : 30,
    "attack"      : 20,
    "power"       : 80,
    "difficulty"  : 70,
    "NameP"       : "Centre de l'Univers",
    "passive"     : "PASSIVE :  Trois étoiles tournent autour de la bordure intérieure de Aurelion Sol, infligeant des dégâts magiques à toutes les unités ennemies touchées. Centre de l'univers exécute les sbires ayant moins de 25 PV.\n Quand Aurelion Sol est affecté par un contrôle de foule rendant incapable d'agir, Centre de l'univers est désactivée pendant la durée du contrôle de foule.",
    "imgPassive"  : "aurelionSol/P.pnj",
    "NameA"       : "Stellogenèse",
    "A"           : "PREMIÈRE ACTIVATION : Aurelion Sol envoie une nouvelle étoile vers la direction ciblée. Pendant la durée de l'effet, la taille de la zone augmente en fonction de la distance parcouru par l'étoile. Quand l'étoile a atteint la bordure extérieure de Aurelion Sol, elle explose, infligeant des dégâts magiques à toutes les unités ennemies dans la zone et les étourdissant pendant 1.1 / 1.2 / 1.3 / 1.4 / 1.5 sec.\n Pendant la durée de l'effet, Aurelion Sol augmente sa vitesse de déplacement lorsqu'il se déplace vers l'étoile.\n DEUXIÈME ACTIVATION : Aurelion Sol fait exploser immédiatement l'étoile.",
    "imgA"        : "aurelionSol/A.pnj",
    "NameZ"       : "Expansion Céleste",
    "Z"           : "PASSIVE :  Augmente les dégâts de base de Centre de l'univers.\n ACTIVE :  Aurelion Sol fait tourner ses étoiles autour de sa bordure extérieure, infligeant des dégâts magiques renforcés à toutes les unités ennemies touchées.\n Pendant la durée de l'effet, Expansion céleste coûte 16 / 22 / 28 / 34 / 40 mana par sec.",
    "imgZ"        : "aurelionSol/Z.pnj",
    "NameE"       : "Comète légendaire",
    "E"           : "PASSIVE : Aurelion Sol génère des charges de Comète légendaire lorsqu'il se déplace, jusqu'à un maximum de 100 charges. Aurelion Sol augmente sa vitesse de déplacement lorsqu'il se déplace en ligne droite, jusqu'à un maximum de 20 / 25 / 30 / 35 / 40%. Au maximum de charges de Comète légendaire, Aurelion Sol peut utiliser Comète légendaire.\nACTIVE :  Aurelion Sol ne fait plus trouner ses étoiles et s'envole vers la direction ciblée, traversant les obstacles et octroyant la vision de la zone traversée.\n Pendant la durée de l'effet, Aurelion Sol peut utiliser Stellogenèse.\n L'effet prend fin si Aurelion Sol attaque ou subit des dégâts des champions ou des tourelles.",
    "imgE"        : "aurelionSol/E.pnj",
    "NameR"       : "Cri de lumière",
    "R"           : "ACTIVE :  Aurelion Sol pousse un cri vers la direction ciblée, infligeant des dégâts magiques à toutes les unités ennemies touchées, les repoussant vers la bordure extérieure de Aurelion Sol et les ralentissant pendant 2 sec.",
    "imgR"        : "aurelionSol/R.pnj",
    "history"     : "text/aurelionSol.txt"
  },

  {
    "name"        : "Azir",
    "imageChp"    : "azir/chp.pnj",
    "type"        : "Mage",
    "defense"     : 30,
    "attack"      : 60,
    "power"       : 80,
    "difficulty"  : 90,
    "NameP"       : "Héritage de Shurima",
    "passive"     : "PASSIVE : Azir marque les tourelles extérieures et intérieures ennemies détruites.\n DISQUE SOLAIRE : Azir peut utiliser Héritage de Shurima sur une tourelle ennemie marquée, générant un Disque Solaire se comportant comme une tourelle alliée pendant 60 sec.\n Le Disque Solaire perd ses PV en 60 sec, perd son armure quand Azir n'est plus dans la zone ou meurt et augmente ses dégâts d'attaque en fonction de la puissance de Azir.\nDÉGÂTS D'ATTAQUE BONUS : 15% de la puissance de Azir.\nHéritage de Shurima a un délai de récupération fixe de 180 sec.",
    "imgPassive"  : "azir/P.pnj",
    "NameA"       : "Sables Conquérants",
    "A"           : "ACTIVE : Azir envoie les soldats de sable vers la zone ciblée, infligeant des dégâts magiques à toutes les unités ennemies traversées et dans la zone, et les ralentissant pendant 1 sec.\nUne même unité ennemie ne peut être affectée que par les dégâts de 1 soldat de sable.",
    "imgA"        : "azir/A.pnj",
    "NameZ"       : "Dresse-toi!",
    "Z"           : "PASSIVE :  Augmente la vitesse d'attaque de Azir.\nAzir génère 1 charge de Dresse-toi ! toutes les 12 - 6.6 / 11 - 6.05 / 10 - 5.5 / 9 - 4.95 / 8 - 4.4 sec, jusqu'à un maximum de 2 charges.\nACTIVE : Azir consomme 1 charge de Dresse-toi ! et invoque un soldat de sable impossible à cibler dans la zone ciblée. Si Azir lance un ordre d'attaque contre une unité ennemie étant dans la portée d'attaque du soldat de sable et dans la zone de commandement, il attaque alors à la place de Azir, infligeant des dégâts magiques à toutes les unités ennemies dans la zone devant lui.\nUne même unité ennemie peut être affectée par les dégâts de plusieurs soldats de sable, mais les soldats de sable infligent des dégâts magiques réduits supplémentaires après le premier soldat de sable.\nAzir peut utiliser Sables Conquérants pour déplacer les soldats de sable.\nLes soldats de sable durent jusqu'à 9 sec, 4.5 sec quand ils sont invoqués dans la portée d'attaque d'une tourelle ennemie, et expirent instantanément quand Azir n'est plus dans la zone.",
    "imgZ"        : "azir/Z.pnj",
    "NameE"       : "Sables Mouvants",
    "E"           : "ACTIVE : Azir fonce vers le soldat de sable le plus proche, infligeant des dégâts magiques à toutes les unités ennemies traversées.\nPendant la durée de l'effet, si Azir traverse un champion ennemi, il s'arrête immédiatement et s'octroie un bouclier pendant 4 sec.\nPendant la durée de l'effet, Azir peut utiliser Sables Conquérants.",
    "imgE"        : "azir/E.pnj",
    "NameR"       : "Partition Impériale",
    "R"           : "ACTIVE : Azir invoque une formation impénétrable de 4 / 5 / 6 soldats de sable et l'envoie depuis derrière lui, vers la zone ciblée, infligeant des dégâts magiques à toutes les unités ennemies touchées et les repoussant.\nÀ la fin de l'effet, la formation s'immobilise et dure jusqu'à 3 sec, empêchant les dashs ennemis. Les soldats de sable de Partition Impériale sont incontrôlables.\nAzir et les champions alliées peuvent traverser le mur.",
    "imgR"        : "azir/R.pnj",
    "history"     : "text/azir.txt"
  },

  {
    "name"        : "Bard",
    "imageChp"    : "bard/chp.pnj",
    "type"        : "Support",
    "defense"     : 40,
    "attack"      : 40,
    "power"       : 50,
    "difficulty"  : 90,
    "NameP"       : "Instinct du voyageur",
    "passive"     : "CARILLONS ANTIQUES : Bard génère des carillons autour de lui dans des zones aléatoires de la carte. Quand Bard collecte un carillon, il gagne de l'expérience, augmente sa vitesse de déplacement lorsqu'il n'est pas en combat et récupère du mana. \nLe bonus en vitesse de déplacement diminue en 7 sec, et est cumulable jusqu'à 5 fois.\nTous les 5 carillons collectés, Bard renforce les Meeps de Instinct du Voyageur.\nMEEPS : Bard génère 1 Meep toutes les 8 / 7 / 6 / 5 / 4 sec, jusqu'à un maximum de 1 / 2 / 3 / 4 Meeps.\nLorsque Bard lance une attaque de base contre une unité ennemie, il consomme 1 Meep et inflige des dégâts magiques supplémentaires à l'impact.\n À partir de 5 carillons collectés, les Meeps ralentissent toutes les unités ennemies touchées pendant 1 sec à l'impact.\n À partir de 25 carillons collectés, les Meeps inflige des dégâts en zone dont la taille augmente à 70 carillons.",
    "imgPassive"  : "bard/P.pnj",
    "NameA"       : "Lien Cosmique",
    "A"           : "ACTIVE :  Bard projette un trait d'énergie cosmique vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée et la ralentissant pendant 1 / 1.2 / 1.4 / 1.6 / 1.8 sec.\nAprès avoir touché une unité ennemie, Lien Cosmique se dirige vers une cible secondaire, infligeant les mêmes dégâts.\nSi Lien Cosmique touche deux unités ennemies, elles sont étourdies pendant 1 / 1.2 / 1.4 / 1.6 / 1.8 sec.",
    "imgA"        : "bard/A.pnj",
    "NameZ"       : "Don du Gardien",
    "Z"           : "ACTIVE : Bard crée un sanctuaire de soin dans la zone ciblée. Le sanctuaire de soin se renforce en 10 sec.\nSi Bard ou les champions alliés se déplacent sur le sanctuaire de soin, ils sont soignés et augmentent leur vitesse de déplacement.\nBard ne peut créer que 3 sanctuaires de soin simultanément. Les champions ennemis peuvent désactiver les sanctuaires de soin.",
    "imgZ"        : "bard/Z.pnj",
    "NameE"       : "Route Magique",
    "E"           : "ACTIVE :  Bard crée un portail à sens unique qui traverse un élément du décor pendant 10 sec. Bard, les champions alliés et les champions ennemis peuvent traverser le portail. Bard et les champions alliés augmentent leur vitesse de déplacement en traversant le portail.",
    "imgE"        : "bard/E.pnj",
    "NameR"       : "Destin Tempéré",
    "R"           : "ACTIVE : Bard envoie une vague d'énergie vers la zone ciblée, mettant en stase toutes les unités touchées pendant 2.5 sec.\nLes monstres épiques et les tourelles sont également mis en stase.",
    "imgR"        : "bard/R.pnj",
    "history"     : "text/bard.txt"
  },

  {
    "name"        : "Blitzcrank",
    "imageChp"    : "blitzcrank/chp.pnj",
    "type"        : "Tank",
    "defense"     : 80,
    "attack"      : 40,
    "power"       : 50,
    "difficulty"  : 40,
    "NameP"       : "Barrière de Mana",
    "passive"     : "PASSIVE :  Quand Blitzcrank possède moins de 20% de ses PV max, Barrière de Mana est activée, générant un boulier pendant 10 sec.\nBOUCLIER : 50% de son mana actuel.\nBarrière de Mana a un délai de récupération fixe de 90 sec.",
    "imgPassive"  : "blitzcrank/P.pnj",
    "NameA"       : "Grappin Propulsé",
    "A"           : "ACTIVE : Blitzcrank tire sa main droite vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée, l'étourdissant pendant 0.5 sec et l'attirant vers Blitzcrank.",
    "imgA"        : "blitzcrank/A.pnj",
    "NameZ"       : "Surcharge",
    "Z"           : "ACTIVE : Blitzcrank augmente sa vitesse d'attaque et sa vitesse de déplacement pendant 5 sec.\nLe bonus en vitesse de déplacement diminue jusqu'à 10% en 5 sec.\nÀ la fin de l'effet, Blitzcrank est ralenti pendant 1.5 sec.",
    "imgZ"        : "blitzcrank/Z.pnj",
    "NameE"       : "Poing d'Acier",
    "E"           : "ACTIVE :  La prochaine attaque de base de Blitzcrank infligera des dégâts physiques renforcés à la cible et l'enverra dans les airs pendant 1 sec.",
    "imgE"        : "blitzcrank/E.pnj",
    "NameR"       : "Champs de Stase",
    "R"           : "PASSIVE : Blitzcrank envoie un éclair sur une unité ennemie aléatoire proche toutes les 2.5 sec, infligeant des dégâts magiques.\nACTIVE :  Blitzcrank fait exploser son champ de stase autour de lui, infligeant des dégâts magiques à toutes les unités ennemies touchées et les réduit au silence pendant 0.5 sec.\nLa propriété passive de Champ de Stase est désactivée pendant le délai de récupération de Champ de Stase.",
    "imgR"        : "blitzcrank/R.pnj",
    "history"     : "text/blitzcrank.txt"
  },

  {
    "name"        : "Brand",
    "imageChp"    : "brand/chp.pnj",
    "type"        : "Mage",
    "defense"     : 20,
    "attack"      : 20,
    "power"       : 90,
    "difficulty"  : 40,
    "NameP"       : "Flammes",
    "passive"     : "PASSIVE :  Lorsque Brand utilise une compétence, il applique 1 effet Flammes à toutes les unités ennemies touchées, infligeant des dégâts magiques supplémentaires en 4 sec.\nFlammes est cumulable jusqu'à 3 fois sur une même unité ennemie.\nLorsque une unité ennemie est affectée par 3 effets Flammes, elle génère une zone autour d'elle. Après 2 sec, la zone explose, infligeant des dégâts magiques à toutes les unités ennemies touchées et leur appliquant 1 effet Flammes.\nUne même unité ennemie ne peut générer une zone que toutes les 4 sec.",
    "imgPassive"  : "brand/P.pnj",
    "NameA"       : "Brûlure",
    "A"           : "ACTIVE : Brand envoie une boule de feu vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée.\n Si la cible est affectée par Flammes, Brûlure étourdira pendant 1.5 sec.",
    "imgA"        : "brand/A.pnj",
    "NameZ"       : "Colonne de Flammes",
    "Z"           : "ACTIVE :  Brand crée une zone. Après 0.625 sec, la zone explose, infligeant des dégâts magiques à toutes les unités ennemies touchées dans la zone.\n Si une cible est affectée par Flammes, Colonne de Flammes infligera des dégâts magiques renforcés à toutes les unités ennemies dans la zone.",
    "imgZ"        : "brand/Z.pnj",
    "NameE"       : "Conflagration",
    "E"           : "ACTIVE : Brand embrase l'unité ennemie ciblée, infligeant des dégâts magiques.\nSi la cible est affectée par Flammes, Conflagration infligera les mêmes dégâts à toutes les unités ennemies dans une zone autour d'elle.",
    "imgE"        : "brand/E.pnj",
    "NameR"       : "Pyrolyse",
    "R"           : "ACTIVE : Brand envoie une énorme boule de feu vers l'unité ennemie ciblée, infligeant des dégâts magiques.\nAprès avoir touché la cible initiale, Pyrolyse rebondit jusqu'à 4 fois sur les unités ennemies proches (en priorité les champions ennemis), infligeant les mêmes dégâts à chaque rebond.\nPendant la durée de l'effet, si une cible devient impossible à cibler, Pyrolyse rebondira sur une autre unité ennemie proche. Si la cible initiale devient impossible à cibler et qu'aucune autre unité ennemie n'est proche, Brand récupère du mana et le délai de récupération de Pyrolyse est réinitialisée.\nSi la cible initiale est affectée par Flammes, Pyrolyse ralentira toutes les unités ennemies touchées brièvement.",
    "imgR"        : "brand/R.pnj",
    "history"     : "text/brand.txt"
  },

  {
    "name"        : "Braum",
    "imageChp"    : "braum/chp.pnj",
    "type"        : "Support",
    "defense"     : 90,
    "attack"      : 30,
    "power"       : 40,
    "difficulty"  : 30,
    "NameP"       : "Coups Etourdissants",
    "passive"     : "PASSIVE :  Les attaques de base de Braum et Morsure de l'Hiver appliquent 1 effet Coups Étourdissants à la cible à l'impact. À partir de 1 effet Coups Étourdissants sur une cible, les attaques de base des champions alliés appliquent également 1 effet Coups Étourdissants à la cible à l'impact.\nCoups Étourdissants est cumulable jusqu'à 4 fois sur une même unité ennemie.\nLorsqu'une unité ennemie est affectée par 4 effets Coups Étourdissants, elle subit des dégâts magiques et elle est étourdie pendant 1.25 / 1.5 / 1.75 sec.\nLorsqu'une unité ennemie a été affectée par l'étourdissement, elle devient immunisée à Coups Étourdissants pendant 8 / 7 / 6 sec. Pendant la durée de l'immunité, les attaques de base de Braum et Morsure de l'Hiver infligent des dégâts magiques supplémentaires à l'unité ennemie immunisée à l'impact.",
    "imgPassive"  : "braum/P.pnj",
    "NameA"       : "Morsure de l'Hiver",
    "A"           : "ACTIVE :  Braum projette des éclats de glace pure vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée et la ralentissant.\nLe ralentissement diminue en 2 sec.",
    "imgA"        : "braum/A.pnj",
    "NameZ"       : "Bouclier Humain",
    "Z"           : "ACTIVE :  Braum fonce vers l'unité alliée ciblée. À l'arrivée, Braum se positionne entre la cible et le champion ennemi le plus proche et augmente son armure et sa résistance magique pendant 3 sec.\nSi l'unité alliée ciblée est un champion allié, Braum augmente également l'armure et la résistance magique de la cible pendant 3 sec à l'arrivée.",
    "imgZ"        : "braum/Z.pnj",
    "NameE"       : "Incassable",
    "E"           : "ACTIVE : Braum lève son bouclier devant lui pendant 4 sec, bloquant tous les projectiles le traversant dans la direction ciblée. Le premier projectile bloqué n'inflige pas de dégâts à Braum, mais les projectiles suivants lui infligeront des dégâts physiques et des dégâts magiques réduits.\nPendant la durée de l'effet, Braum augmente sa vitesse de déplacement et peut traverser les unités.",
    "imgE"        : "braum/E.pnj",
    "NameR"       : "Fissure Glaciale",
    "R"           : "ACTIVE :  Braum saute et frappe le sol avec son bouclier, créant autour de lui et vers la direction ciblée une fissure infligeant des dégâts magiques à toutes les unités ennemies dans la zone.\nFissure Glaciale envoie également dans les airs toutes les unités ennemies touchées, pendant 1 / 1.25 / 1.5 sec dans la zone autour de Braum, et pendant 0.25 sec dans la zone devant Braum.\nSi aucun champion ennemi n'a été touché dans la zone autour de Braum, Fissure Glaciale enverra dans les airs le premier champion ennemi touché dans la zone devant Braum pendant 1 / 1.25 / 1.5 sec.\nÀ la fin de l'effet, la fissure dure jusqu'à 4 sec, ralentissant toutes les unités ennemies dans la zone.",
    "imgR"        : "braum/R.pnj",
    "history"     : "text/braum.txt"
  },

  {
    "name"        : "Caitlyn",
    "imageChp"    : "caitlyn/chp.pnj",
    "type"        : "Tireur",
    "defense"     : 20,
    "attack"      : 80,
    "power"       : 20,
    "difficulty"  : 60,
    "NameP"       : "Tir dans la tête",
    "passive"     : "PASSIVE :  Augmente la vitesse d'attaque de Caitlyn.\nLes attaques de base de Caitlyn génèrent 1 effet Dans la Tête à l'impact, cumulable jusqu'à 6 fois. Les attaques de base quand Caitlyn est dans les hautes herbes génèrent 2 effets Tir Dans la Tête à l'impact.\nÀ 6 effets Tir Dans la Tête, la prochaine attaque de base de Caitlyn sera un Tir dans la tête, consommant les 6 effets Tir Dans la Tête et infligeant des dégâts physiques renforcés.\nQuand une unité ennemie est affectée par Piège-Yordle ou par Filet de Calibre 90, la prochaine attaque de base de Caitlyn contre cette cible sera un Tir dans la tête, consommant tous les effets Tir Dans la Tête. Caitlyn augmente sa portée d'attaque quand elle lance un Tir dans la tête contre cette cible.",
    "imgPassive"  : "caitlyn/P.pnj",
    "NameA"       : "Pacificateur de Piltover",
    "A"           : "ACTIVE : Caitlyn tire un projectile vers la direction ciblée, infligeant des dégâts physiques à la première unité ennemie touchée.\nPacificateur de Piltover traverse ensuite la première cible, infligeant des dégâts physiques réduits à toutes les unités ennemies traversées.\nSi une unité ennemie est affectée par Piège-Yordle, Pacificateur de Piltover lui inflige le maximum des dégâts.",
    "imgA"        : "caitlyn/A.pnj",
    "NameZ"       : "Piège-Yordle",
    "Z"           : "PASSIVE :  Caitlyn génère 1 charge de Piège-Yordle toutes les 45 - 24.75 / 32.5 - 17.875 / 20 - 12 / 12.5 - 6.875 / 10 - 5.5 sec, jusqu'à un maximum de 3 / 3 / 4 / 4 / 5 charges.\nACTIVE :  Caitlyn consomme 1 charge de Piège-Yordle et pose un piège dans la zone ciblée. Après 1.1 sec, le piège est activé.\nSi un champion ennemi se déplace sur le piège, il est immobilisé pendant 2 sec et le prochain Tir dans la tête de Caitlyn contre cette cible infligera des dégâts physiques supplémentaires.\nLes pièges de Piège-Yordle durent jusqu'à 90 sec, et Caitlyn peut poser jusqu'à 3 / 3 / 4 / 4 / 5 pièges simultanément.\nCaitlyn obtient la vision pure sur le champion ennemi affecté par Piège-Yordle pendant 9 sec. Une même cible ne peut être affectée que par un piège dans la même zone toutes les 4 sec.",
    "imgZ"        : "caitlyn/Z.pnj",
    "NameE"       : "Filet de Calibre 90",
    "E"           : "ACTIVE :  Caitlyn tire un filet vers la direction ciblée, infligeant des dégâts magiques à la première unité ennemie touchée et la ralentissant pendant 1 sec.\nAu début de l'effet, Caitlyn se projette en arrière.",
    "imgE"        : "caitlyn/E.pnj",
    "NameR"       : "Tir Chirurgical",
    "R"           : "ACTIVE :  Caitlyn verrouille le champion ennemi ciblé pendant 1 sec. Après 1 sec, Caitlyn tire un énorme projectile, infligeant des dégâts physiques au champion ennemi ciblé.\nLes champions ennemis peuvent intercepter Tir Chirurgical à la place de la cible initiale, subissant les mêmes dégâts.\nAu début de l'effet, Caitlyn obtient la vision pure sur la cible initiale.",
    "imgR"        : "caitlyn/R.pnj",
    "history"     : "text/caitlyn.txt"
  }

]