[
  {
    "name": "La Faille de l'Invocateur",
    "smalldescription": "Cette carte destinée au combats 5c5, est constituée de 3 couloirs et de 2 jungles séparées par une rivière, entourant le couloir central.",
    "type": "5 contre 5",
    "imagemaps": "carte_5v5.jpg",
    "bigdescription": "La première carte annoncée, la Faille de l'Invocateur (5c5), est similaire à la carte de DotA. Comme dans DotA, vous commencez la partie dans votre propre base et vous combattez sur trois voies, pour détruire trois types de bâtiments. On distingue respectivement : les tourelles (éléments protecteurs de la faille de l'invocateur), les inhibiteurs (qui, une fois détruits, permettent de donner un avantage à votre équipe en générant des sbires renforcés (super-sbires), plutôt appelés creeps ou minions par les invocateurs) et pour finir le nexus (le « cœur » de la base de chaque équipe). Le but de votre équipe est de détruire ces tourelles et ces inhibiteurs afin de faire avancer cette dernière ainsi que vos sbires jusqu'au nexus de la base adverse, le but étant de le détruire31. L'équipe ennemie tente bien entendu de faire de même.\nCes voies sont reliées entre elles par un espace neutre appelé « jungle » dans lequel se trouvent des mobs (monstres) dit « neutres ». Ces monstres ne sont pas agressifs mais peuvent être attaqués et se défendre, ils octroient de l'or, de l'expérience et parfois des bonus temporaires plus ou moins importants (par exemple la Sentinelle Bleue (buff blue) qui apporte une régénération de mana accrue et une réduction de délais de récupération ou le Roncier Rouge (buff red) qui permet d'appliquer un ralentissement et des dégâts lors des attaques de base). Une rivière parcourt également la carte, en bordure de laquelle se trouvent deux monstres épiques : le Dragon, et le Baron Nashor ; les tuer rapporte de l'or et de l'expérience à toute votre équipe et notamment un buff important concernant le baron Nashor sur les sbires, les statistiques et le rappel est plus rapide. Le dragon offre des bonus différents en fonction du nombre de fois où l'équipe bat le dragon : le 1er dragon battu augmente la puissance et les dégâts d'attaque, le 2e augmente les dégâts sur les bâtiments, le 3e augmente la vitesse de déplacement, le 4e augmente les dégâts infligés aux sbires et aux monstres, le 5e double les bonus précédents et les sorts et les attaques de base font brûler la cible, lui infligeant des dégâts et la révélant. Mais depuis le patch 6.9, les dragons ont été retravaillés en plusieurs types (Géo Dragon, Aqua Dragon, Pyro Dragon, Aéro Dragon...). Selon le dragon tué, certains buffs sont octroyés aux joueurs.\nEn plus de la Faille de l'Invocateur de base, il fut possible de jouer sur trois autres cartes : « été », « automne » (version Halloween) et « hiver » (version Noël), qui sont des remaniements graphiques de la carte de base, mais dont les caractéristiques sont identiques. Spécialement pour l'hiver 2011, La Faille de l'Invocateur version hivernale est réapparue, avec quelques modifications32.\nLa Faille de l'Invocateur fut l'objet de critiques car elle n'était pas parfaitement équilibrée. En effet, en avril 2014, l'équipe bleue avait 57% de chance d'y gagner, contre 43% pour l'équipe violette33, ce qui pourrait être, pour certains non pas à cause de la carte, symétrique, mais à cause de la caméra en vue isométrique ou de l'interface située en bas de l'écran : aucune cause n'est pour le moment établie avec certitude.\nEn décembre 2014, la Nouvelle Faille de l'Invocateur a fait son apparition dans les serveurs publics. Elle a été totalement retravaillée (jungle, architecture des bases, tourelles, sbires...).",
    "playModes": "Classée Solo ou Duo, Classée Flexible, Normal Aveugle ou Draft"
  },

  {
    "name": "La Forêt Torturée",
    "smalldescription": "Il s'agit d'une forêt obscure accueillant des combats 3c3 avec 2 couloirs et 1 jungle.",
    "type": "3 contre 3",
    "imagemaps": "carte_3v3.jpg",
    "bigdescription": "La Forêt Torturée (3c3) est une carte plus petite que la Faille de l'Invocateur. C'est une carte très technique du fait de sa forme et surtout du nombre de joueurs. En effet, une erreur en 5c5 est bien moins grave qu'une erreur en 3c3 qui pourra modifier totalement le cours de la partie. C'est pourquoi, dans ce mode, adopter la prudence ou attaquer en groupe très tôt sont des tactiques efficaces. Cette carte possède deux autels, un de chaque côté de la carte qui devra être capturé pour obtenir un buff (+3 pièces d'or par ennemi tué pour un autel possédé, +10 % d'attaque pour le second autel et +10% de puissance si les deux autels sont possédés). De plus, une araignée (Vilemaw) donne à toute l'équipe de l'or et un buff de 10 % de vitesse d'attaque et de réduction des délais de récupération lorsqu'elle est vaincue. Les parties en forêt torturée (généralement 20 à 30 minutes) durent en moyenne moins longtemps que les parties en faille de l'invocateur (souvent de l'ordre de 30 à 45 minutes) et fut aussi beaucoup utilisée pour les parties personnalisées en 1c1 jusqu'à ce que le Centre d'Entrainement sorte, suivi de l'Abîme hurlant. Le Baron de Nashor n'est pas présent sur cette carte mais est remplacé par une araignée géante qui est certes moins puissante que le baron mais qui est un boss redoutable.",
    "playModes": "Classée, Normal"
  },

  {
    "name": "La Brèche de Cristal",
    "smalldescription": "Cette carte étaitt utilisée en mode Dominion ; elle est constituée de 5 cristaux répartis de manière circulaire par rapport au centre de la carte ; cette carte a été supprimée depuis le 22 février 2016, puis à été réactivée pour le nouveau mode de jeu temporaire Ascension.",
    "type": "5 contre 5",
    "imagemaps": "carte_dominion.jpg",
    "bigdescription": "En septembre 2011 est apparue une nouvelle carte : la Brèche de Cristal. Celle-ci offre un tout nouveau mode de jeu appelé Dominion34, basé sur la capture de points stratégiques. Il existe cinq points de capture en tout sur la carte : la raffinerie, l'ossuaire, la carrière, la foreuse et le moulin. Contrôler plus de points que l'adversaire endommagera son nexus. La première équipe dont les PV du nexus atteignent zéro perd la partie. Le style de jeu de cette carte est beaucoup plus frénétique, l'or et l'expérience sont gagnés plus rapidement, le temps passé mort est réduit. Une partie dans la Brèche de Cristal dure environ 15 minutes à 25 minutes. La balise de base est remplacée par un objet permettant de ressusciter instantanément en échange d'une charge (des charges sont ajoutées en fonction du niveau du champion et il ne peut y avoir que deux charges par objet). Le rappel est aussi plus rapide que pour la faille de l'invocateur.\nLe mode de jeu Dominion à été supprimé durant l'année 2016. Quelques mois plus tard, un nouveau mode de jeu temporaire est apparu : L’ascension (voir dans les modes de jeu temporaires), qui a permit de rouvrir cette carte.",
    "playModes": "Dominion, Ascension"
  },

  {
    "name": "L'Abîme Hurlant",
    "smalldescription": "Une carte destinée aux combats en mode ARAM 5c5 avec 1 couloir, une atmosphère polaire et dépourvue de jungle.",
    "type": "5 contre 5",
    "imagemaps": "carte_aram.jpg",
    "bigdescription" : "En début d'année 2012, Riot Games annonce qu'une nouvelle carte sera disponible : Centre d'Entrainement, mais uniquement pour les parties personnalisées. C'est en fait la carte du tutoriel du jeu, légèrement modifiée pour correspondre au mode de jeu ARAM, inventé par les joueurs. Certains objets ne sont pas achetables et d'autres règles existent sur cette carte. Un an plus tard, Abîme hurlant, une nouvelle carte introduite à la version 3.6 du jeu remplaça le Centre d'Entraînement. Un matchmaking spécial fût instauré dans le même patch, avec un système de relance, pour échanger aléatoirement le champion accordé au début de partie. Cette carte se compose d'une seule voie créant un chemin entre les deux bases, composées de deux tours, d'un inhibiteur, deux tourelles du nexus, et d'un Nexus pour chaque camp. L'histoire du jeu indique que le pont qui enjambe l'Abîme hurlant se situe aux endroits les plus profonds de Freljord, un monde de League of Legends.",
    "playModes": "Aram, Légende du Roi Poro"
  }
]